type HistoricalEvent = {
  time: string
  name: string
}

export const historyTimeline: HistoricalEvent[] = [
  {
    time: 'ძვ. წ-ის VI',
    name: 'ბერძნებთან',
  },
  {
    time: 'ძვ. წ-ის IV-III სს',
    name: 'ქართლის სამეფო',
  },
  {
    time: 'I საუკუნიდან',
    name: 'საქართველოში ქრისტიანობის',
  },
  {
    time: 'II საუკუნეში',
    name: 'ფარსმან II ქველი',
  },
  {
    time: '325 წელს',
    name: 'მსოფლიოს I საეკლესიო კრებას',
  },
  {
    time: 'IV საუკუნეში',
    name: 'ქრისტიანობა სახელმწიფო რელიგიად',
  },
  {
    time: 'V საუკუნეში',
    name: 'პირველი ქართული ლიტერატურული ნაწარმოები',
  },
  {
    time: 'V საუკუნეში',
    name: 'ვახტანგ გორგასალი',
  },
  {
    time: 'V საუკუნეში',
    name: 'თბილისი ქართლის სამეფოს დედაქალაქი',
  },
  {
    time: 'VI საუკუნეში',
    name: 'სპარსეთი და ბიზანტია',
  },
  {
    time: 'VII საუკუნეში',
    name: 'არაბებმა',
  },
  {
    time: 'VIII საუკუნეში',
    name: 'მურვან-ყრუმ',
  },
  {
    time: 'VIII-IX საუკუნეების',
    name: 'გრიგოლ ხანძთელთან',
  },
  {
    time: 'XI საუკუნეში',
    name: 'გაერთიანება',
  },
  {
    time: 'XI საუკუნეში',
    name: 'გიორგი I',
  },
  {
    time: 'XI საუკუნეში',
    name: 'ბაგრატ IV',
  },
  {
    time: 'XI საუკუნეში',
    name: 'თურქ-სელჩუკები',
  },
  {
    time: 'XI საუკუნის',
    name: 'დიდ თურქობას',
  },
  {
    time: 'XI საუკუნეში',
    name: 'სვეტიცხოველის ტაძარი',
  },
  {
    time: '1089 წელს',
    name: 'გამეფდა დავით აღმაშენებელი',
  },
  {
    time: '1125 წელს',
    name: 'გარდაიცვალა დავით აღმაშენებელი',
  },
  {
    time: '1121 წელს',
    name: 'დიდგორის ბრძოლა',
  },
  {
    time: 'XII საუკუნეში',
    name: 'ვეფხისტყაოსანი',
  },
  {
    time: 'XIII საუკუნეში',
    name: 'ბასიანის ბრძოლა',
  },
  {
    time: 'XIII საუკუნეში',
    name: 'ლაშა-გიორგი',
  },
  {
    time: 'XIII საუკუნეში',
    name: 'მონღოლებმა',
  },
  {
    time: 'XIV საუკუნეში',
    name: 'გიორგი V ბრწყინვალე',
  },
  {
    time: 'XV საუკუნეში',
    name: 'დაიშალა',
  },
  {
    time: '1412-1442 წლების',
    name: 'ალექსანდრე I',
  },
  {
    time: '1555 წელს',
    name: 'სპარსეთმა და ოსმალეთმა',
  },
  {
    time: 'XVII საუკუნეში',
    name: 'შაჰ-აბასმა',
  },
  {
    time: 'XVII საუკუნეში',
    name: 'მარაბდისა და მარტყოფის',
  },
  {
    time: 'XVIII საუკუნეში',
    name: 'ვახტანგ VI',
  },
  {
    time: 'XVIII საუკუნეში',
    name: 'ერეკლე II',
  },
  {
    time: '1744 წელს',
    name: 'ერეკლე II',
  },
  {
    time: 'XVIII საუკუნეში',
    name: 'კრწანისის ბრძოლა',
  },
  {
    time: '1783 წელს',
    name: 'გეორგიევსკის ტრაქტატი',
  },
  {
    time: 'XIX საუკუნეში',
    name: 'რუსეთმა',
  },
  {
    time: '1810 წელს',
    name: 'რუსეთის იმპერიამ იმერეთის სამეფო',
  },
  {
    time: 'XIX საუკუნეში',
    name: 'რუსეთი, თურქეთი და სპარსეთი',
  },
  {
    time: '1832 წელს',
    name: 'ანტირუსული აჯანყება',
  },
]
